Revit 2027 API
PostDocEventArgs Properties
The PostDocEventArgs type exposes the following members.
Properties
Name | Description
Cancel |  Indicates whether the event is being cancelled. When the event is cancellable, set the property to True to cancel it.
(Inherited from RevitEventArgs)
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitEventArgs)
Document |  The document associated with the event.
Status |  Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
(Inherited from PostEventArgs)
Top
See Also
Reference
PostDocEventArgs Class
Autodesk.Revit.DB.Events Namespace